InformationRegisters/DMS_ДанныеФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_ДанныеФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/DMS_СоответствиеИменИОтчества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_СоответствиеИменИОтчества</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_НормализованныеКонтактыДляПоиска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_НормализованныеКонтактыДляПоиска</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_КлиентскиеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_КлиентскиеДанные</Name>
			<Comment>Черновая временная версия архитектуры</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПредложенияИЗамечания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВыбораМарки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныВыбораМарки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркаТекущегоАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркаПредыдущегоАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписантВЛице</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписантНаОсновании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписантПодпись</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписантДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтказОтКонтакта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СогласиеНаПолучениеSMSДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/DMS_СправочнаяИнформацияПоФИО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_СправочнаяИнформацияПоФИО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ТипыЗначенийФИО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Renault_ПолФизическогоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_ПолФизическогоЛица</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФормыСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыСобственности</Name>
			<Comment>Варианты форм собственности контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Comment>Любая форма юридического лица</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастныйПредприниматель</Name>
					<Comment>Частный предприниматель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
					<Comment>Частное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий вид собственности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/DMS_ТипыЗначенийФИО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>DMS_ТипыЗначенийФИО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Фамилия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчество</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДокументов</Name>
			<Comment>Виды подтверждающих документов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сертификат</Name>
					<Comment>Сертификат</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидНаЖительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Свидетельство</Name>
					<Comment>Свидетельство</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпискаИзЭлектронногоПаспорта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лицензия</Name>
					<Comment>Лицензия</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паспорт</Name>
					<Comment>Общегражданский паспорт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удостоверение</Name>
					<Comment>Удостоверение личности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доверенность</Name>
					<Comment>Доверенность</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВоенныйБилет</Name>
					<Comment>Военный билет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справка</Name>
					<Comment>Справка (например об освобождении)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервиснаяКнижка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий документ удостоверяющий личность</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПТС</Name>
					<Comment>Паспорт транспортного средства</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АттестатТО</Name>
					<Comment>Аттестат аккредитации оператора технического осмотра транспортных средств</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПолФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПолФизическихЛиц</Name>
			<Comment>Пол физических лиц</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеУказан</Name>
					<Comment>Пол не указан</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
					<Comment>Пол мужской</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
					<Comment>Пол женский</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/DMS_ФизическиеЛицаСервер/Ext/Module.bsl
// Функция раскладывает ФИО в структуру.
//
// Параметры:
//	 ФИО - строка - наименование
//
// Возвращаемое значение:
//	 Структура - со свойствами: 
//     * Фамилия  - Строка
//     * Имя      - Строка
//     * Отчество - Строка
//
Функция ФамилияИмяОтчество(Знач ФИО) Экспорт
	
	ФИО = СтрЗаменить(ФИО,".","");
	
	СтруктураФИО = Новый Структура("Фамилия, Имя, Отчество","","","");
	
	МассивПодстрок = Renault_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ФИО, " ");
	
	мФИО = "";
	
	Если МассивПодстрок.Количество() > 0 Тогда
		СтруктураФИО.Вставить("Фамилия", ПривестиСтрокуВСоотвествие(МассивПодстрок[0]));
		
		мФИО = мФИО + СтруктураФИО.Фамилия;
		
		Если МассивПодстрок.Количество() > 1 Тогда
			СтруктураФИО.Вставить("Имя", ПривестиСтрокуВСоотвествие(МассивПодстрок[1]));
			мФИО = СокрЛП(мФИО) +" "+ СтруктураФИО.Имя;
		КонецЕсли;
		
		Если МассивПодстрок.Количество() > 2 Тогда
			Отчество = "";
			Для Шаг = 2 По МассивПодстрок.Количество()-1 Цикл
				Отчество = Отчество + МассивПодстрок[Шаг] + " ";
			КонецЦикла;
			Renault_СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(Отчество, 1);
			СтруктураФИО.Вставить("Отчество", ПривестиСтрокуВСоотвествие(Отчество));
			мФИО = СокрЛП(мФИО) +" "+ СтруктураФИО.Отчество;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураФИО.Вставить("ФИО",СокрЛП(мФИО));
	
	Возврат СтруктураФИО;
	
КонецФункции

// Функция раскладывает ФИО в структуру.
//
// Параметры:
//	 ФИО - строка - наименование
//
// Возвращаемое значение:
//	 Структура - со свойствами: 
//     * Фамилия  - Строка
//     * Имя      - Строка
//     * Отчество - Строка
//
Функция ПолучитьКонтрагентаПоФИО(Знач ФИО) Экспорт
	
	СтруктураФИО = ФамилияИмяОтчество(ФИО);
	
	Запрос = Новый Запрос;
	
	Для каждого ТекущийПараметр Из СтруктураФИО Цикл
		Запрос.УстановитьПараметр(ТекущийПараметр.Ключ,ТекущийПараметр.Значение);
	КонецЦикла; 
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	ДанныеФизическихЛиц.ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|ГДЕ
		|	ДанныеФизическихЛиц.Фамилия = &Фамилия
		|	И ДанныеФизическихЛиц.Имя = &Имя
		|	И ДанныеФизическихЛиц.Отчество = &Отчество
		|	И ДанныеФизическихЛиц.ФизическоеЛицо ССЫЛКА Справочник.Контрагенты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ФизическоеЛицо = Неопределено;
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		ФизическоеЛицо = ВыборкаДетальныеЗаписи.ФизическоеЛицо;			
	КонецЕсли;
	
	Возврат ФизическоеЛицо;
	
КонецФункции

Функция ПривестиСтрокуВСоотвествие(СтроковоеЗначение)
	
	СимволыУдаления = "-,/,',"""",?,&,!@,№,#,$,%,^,&,*,(,)=,+,."+"""";
	
	МассивСимволов = Renault_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(СимволыУдаления,",");
	
	Для каждого УдаляемыйСимвол Из МассивСимволов Цикл
		СтроковоеЗначение = СтрЗаменить(СтроковоеЗначение,УдаляемыйСимвол,"");
	КонецЦикла; 
	
	Возврат ТРег(СокрЛП(СтрЗаменить(НРег(СтроковоеЗначение),"ё","е")));	

КонецФункции // ПривестиСтрокуВСоотвествие()

Процедура ЗаписатьФИОФизическогоЛица(ФизическоеЛицо,Пол = Неопределено,ДатаРождения = Неопределено) Экспорт 

	СтруктураФИО = ФамилияИмяОтчество(ФизическоеЛицо.Наименование);
	
	СтруктураФИО.Вставить("ФизическоеЛицо",	ФизическоеЛицо);
	СтруктураФИО.Вставить("Пол",			?(Пол = Неопределено,Перечисления.Renault_ПолФизическогоЛица.ПустаяСсылка(),Пол));
	СтруктураФИО.Вставить("ДатаРождения",	?(ДатаРождения = Неопределено,Дата('00010101'),ДатаРождения));
	
	ДобавитьЗаписьВРегистрСведений(СтруктураФИО,"DMS_ДанныеФизическихЛиц");

КонецПроцедуры

// Создает набор записей регистра сведений по переданным значениям структуры. Добавляет одну запись в набор.
//
// Параметры:
//  СтруктураЗаписи - Структура - структура по значениям которой необходимо создать набор записей и заполнить этот
//                                набор.
//  ИмяРегистра     - Строка - имя регистра сведений.
// 
Функция СоздатьНаборЗаписейРегистраСведений(СтруктураЗаписи, ИмяРегистра) Экспорт
	
	МетаданныеРегистра = Метаданные.РегистрыСведений[ИмяРегистра];
	
	// Создаем набор записей регистра.
	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	
	// Устанавливаем отбор по измерениям регистра.
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		
		// Если задано значение в структуре, то отбор устанавливаем.
		Если СтруктураЗаписи.Свойство(Измерение.Имя) Тогда
			
			НаборЗаписей.Отбор[Измерение.Имя].Установить(СтруктураЗаписи[Измерение.Имя]);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НаборЗаписей;
	
КонецФункции

// Добавляет одну запись в регистр сведений по переданным значениям структуры.
//
// Параметры:
//  СтруктураЗаписи - Структура - структура, по значениям которой необходимо создать набор записей и заполнить этот
//                                набор.
//  ИмяРегистра     - Строка - имя регистра сведений, в который необходимо добавить запись.
// 
Процедура ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, Знач ИмяРегистра, Загрузка = Ложь) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписейРегистраСведений(СтруктураЗаписи, ИмяРегистра);
	
	// Добавляем только одну запись в новый набор записей.
	НоваяЗапись = НаборЗаписей.Добавить();
	
	// Заполняем значения свойств записи из переданной структуры.
	ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураЗаписи);
	
	НаборЗаписей.ОбменДанными.Загрузка = Загрузка;
	
	// записываем набор записей
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Обновляет запись в регистр сведений по переданным значениям структуры.
//
// Параметры:
//  СтруктураЗаписи - Структура - структура, по значениям которой необходимо создать менеджер записи и обновить запись.
//  ИмяРегистра     - Строка - имя регистра сведений, в котором необходимо обновить запись.
// 
Процедура ОбновитьЗаписьВРегистрСведений(СтруктураЗаписи, Знач ИмяРегистра) Экспорт
	
	МетаданныеРегистра = Метаданные.РегистрыСведений[ИмяРегистра];
	
	// Создаем менеджер записи регистра.
	МенеджерЗаписи = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
	
	// Устанавливаем отбор по измерениям регистра.
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		
		// Если задано значение в структуре, то отбор устанавливаем.
		Если СтруктураЗаписи.Свойство(Измерение.Имя) Тогда
			
			МенеджерЗаписи[Измерение.Имя] = СтруктураЗаписи[Измерение.Имя];
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Считываем запись из базы данных.
	МенеджерЗаписи.Прочитать();
	
	// Заполняем значения свойств записи из переданной структуры.
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураЗаписи);
	
	// записываем менеджер записи
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция ОпределитьПолПоОтчеству(ФизическоеЛицо,ОтчествоРаботника) Экспорт 
	
	Если Прав(ОтчествоРаботника, 2) = "ич" Тогда
		Возврат Перечисления.Renault_ПолФизическогоЛица.Мужской;
	ИначеЕсли Прав(ОтчествоРаботника, 2) = "на" Тогда
		Возврат Перечисления.Renault_ПолФизическогоЛица.Женский;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ОпределитьПолПоОтчеству()

Функция ПросклонятьФИО(Знач ФИО,Падеж = "Р")Экспорт 
	
	ОпределениеМорфер=Новый WSОпределения("http://api.morpher.ru/WebService.asmx?WSDL");
	Морфер=Новый WSПрокси(ОпределениеМорфер,"http://morpher.ru/","WebService","WebServiceSoap");
	
	Результат = Морфер.GetXml(ФИО);
	
	Возврат Результат[Падеж]
	
КонецФункции // ПросклонятьФИО()

Функция ПросклонятьЧерезМорфер30(СтрокаДляСклонения, Падеж = "Р") Экспорт
    // default init
    Токен = null;
    АдресСервера = "ws3.morpher.ru";
    Соединение = Новый HTTPСоединение(АдресСервера,,,,,, Новый ЗащищенноеСоединениеOpenSSL());
    ТекстЗапроса = "/russian/declension?s=" + СтрокаДляСклонения;
    Если Токен <> null Тогда
        ТекстЗапроса = ТекстЗапроса + "&token=" + Токен;
    КонецЕсли;
    
    Заголовок_ = Новый Соответствие;
    Заголовок_.Вставить("Accept", "application/json");    

    Запрос = Новый HTTPЗапрос(ТекстЗапроса);    
    Запрос.Заголовки = Заголовок_;
	
	Результат = "";
	Попытка
    	Ответ = Соединение.Получить(Запрос);
    	Данные = ПолучитьДанныеИзОтветаМорфер30(Ответ);
		Данные.Свойство(Падеж, Результат);
		Если Результат = Неопределено Тогда
			Результат = "";
		КонецЕсли;
	Исключение
		Сообщить("Не удалось просклонять с использованием сервис morpher.ru.");	
	КонецПопытки;
	
	Возврат Результат;
    
КонецФункции

Функция ПолучитьДанныеИзОтветаМорфер30(Ответ)
     ОтветСтрокой = Ответ.ПолучитьТелоКакСтроку();
    
    Чтение = Новый ЧтениеJson();
    Чтение.УстановитьСтроку(ОтветСтрокой);
    
    Если Ответ.КодСостояния = 200 Тогда
        Данные = ПрочитатьJSON(Чтение, ложь);
        Возврат Данные;
    ИначеЕсли Ответ.КодСостояния = 400 тогда
        Данные = ПрочитатьJSON(Чтение, ложь);
        ВызватьИсключение("Ошибка: " + Данные.message);
    Иначе
        ВызватьИсключение("HTTP ошибка: " + Ответ.КодСостояния);
    КонецЕсли;        
КонецФункции

// Функция склоняет переданную фразу.
// Только для работы на ОС Windows.
//
// Параметры:
//  ФИО   - Строка - фамилия, имя и отчество в именительном падеже, 
//                   которые необходимо просклонять.
//  Падеж - Число  - падеж, в который необходимо поставить ФИО:
//                   1 - Именительный
//                   2 - Родительный
//                   3 - Дательный
//                   4 - Винительный
//                   5 - Творительный
//                   6 - Предложный
//  Результат - Строка - в этот параметр помещается результат склонения.
//                       Если ФИО не удалось просклонять, то возвращается значение ФИО.
//  Пол       - Число - пол физического лица, 1 - мужской, 2 - женский.
//
// Возвращаемое значение:
//   Булево - Истина, если ФИО удалось просклонять.
//
Функция Просклонять(Знач ФИО, Падеж, Результат, Пол = Неопределено) Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация();
	Если СистемнаяИнформация.ТипПлатформы <> ТипПлатформы.Windows_x86 
		И СистемнаяИнформация.ТипПлатформы <> ТипПлатформы.Windows_x86_64 Тогда
		
		Результат = ФИО;
		Возврат Ложь;
		
	КонецЕсли;	
	
	ПодключитьВнешнююКомпоненту("ОбщийМакет.DMS_КомпонентаСклоненияФИО", "Decl");
	Компонента = Новый("AddIn.Decl.CNameDecl");
	
	Результат = "";
	
	МассивСтрок = Renault_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ФИО, " ");
	
	// Выделим первые 3 слова, так как компонента не умеет склонять фразу большую 3х символов.
	НомерНесклоняемогоСимвола = 4;
	Для Номер = 1 По Мин(МассивСтрок.Количество(), 3) Цикл
		Если Не ФИОНаписаноВерно(МассивСтрок[Номер-1], Истина) Тогда
			НомерНесклоняемогоСимвола = Номер;
			Прервать;
		КонецЕсли;

		Результат = Результат + ?(Номер > 1, " ", "") + МассивСтрок[Номер-1];
	КонецЦикла;
	
	Если ПустаяСтрока(Результат) Тогда
		Результат = ФИО;
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Если Пол = Неопределено Тогда
			Результат = Компонента.Просклонять(Результат, Падеж) + " ";
			
		Иначе
			Результат = Компонента.Просклонять(Результат, Падеж, Пол) + " ";
			
		КонецЕсли;
		
	Исключение
		Результат = ФИО;
		Возврат Ложь;
		
	КонецПопытки;
	
	// Остальные символы добавим без склонения.
	Для Номер = НомерНесклоняемогоСимвола По МассивСтрок.Количество() Цикл
		Результат = Результат + " " + МассивСтрок[Номер-1];
	КонецЦикла;
	
	Результат = СокрЛП(Результат);
	
	Возврат Истина;
	
КонецФункции

// Проверяет верно ли написано ФИО.
// ФИО может быть написано либо только на кириллице, либо только на латинице.
// Также можно указать, что ФИО может быть верным только в кириллице.
//
// Параметры:
//		СтрокаПараметр - строка - ФИО.
//		ДопустимаТолькоКириллица - если Истина, то ФИО проверяется на кириллицу, латиница в этом случае считается ошибкой.
//									Ложь - ФИО считается верным, если оно написано либо на латинице, либо на кириллице.
//
// Возвращаемое значение:
//		Истина - ФИО написано верно, иначе Ложь.
//
Функция ФИОНаписаноВерно(Знач СтрокаПараметр, ТолькоКириллица = Ложь) Экспорт
	
	ДопустимыеСимволы = "-";
	
	Возврат (НЕ ТолькоКириллица И Renault_СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(СтрокаПараметр, Ложь, ДопустимыеСимволы)) Или
			Renault_СтроковыеФункцииКлиентСервер.ТолькоКириллицаВСтроке(СтрокаПараметр, Ложь, ДопустимыеСимволы);
	
КонецФункции

Функция ПолучитьМассивПредпологаемыхРодственников(ФизическоеЛицо) Экспорт 
	
	СтруктураФИО = ФамилияИмяОтчество(ФизическоеЛицо.Наименование);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаРождения", 	ФизическоеЛицо.ДатаРождения);
	Запрос.УстановитьПараметр("Имя", 			СтруктураФИО.Имя);
	Запрос.УстановитьПараметр("Отчество", 		СтруктураФИО.Отчество);
	Запрос.УстановитьПараметр("Фамилия", 		СтруктураФИО.Фамилия);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	&ФизическоеЛицо КАК ФизическоеЛицо,
		|	&Фамилия КАК Фамилия,
		|	&Имя КАК Имя,
		|	&Отчество КАК Отчество,
		|	СоответствиеИменИОтчества.Отчество КАК ОтчествоДетей,
		|	&ДатаРождения КАК ДатаРождения,
		|	"""" КАК ИмяРодителя
		|ПОМЕСТИТЬ ФизЛицо
		|ИЗ
		|	РегистрСведений.DMS_СоответствиеИменИОтчества КАК СоответствиеИменИОтчества
		|ГДЕ
		|	СоответствиеИменИОтчества.Имя = &Имя
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&ФизическоеЛицо,
		|	&Фамилия,
		|	&Имя,
		|	&Отчество,
		|	"""",
		|	&ДатаРождения,
		|	СоответствиеИменИОтчества.Имя
		|ИЗ
		|	РегистрСведений.DMS_СоответствиеИменИОтчества КАК СоответствиеИменИОтчества
		|ГДЕ
		|	СоответствиеИменИОтчества.Отчество = &Отчество
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&ФизическоеЛицо,
		|	&Фамилия,
		|	&Имя,
		|	&Отчество,
		|	"""",
		|	&ДатаРождения,
		|	""""
		|ИЗ
		|	РегистрСведений.DMS_СоответствиеИменИОтчества КАК СоответствиеИменИОтчества
		|ГДЕ
		|	СоответствиеИменИОтчества.Отчество = &Отчество
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФизЛицо.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДанныеФизическихЛиц.ФизическоеЛицо КАК Родственник,
		|	ВЫБОР
		|		КОГДА ДанныеФизическихЛиц.Пол = ЗНАЧЕНИЕ(Перечисление.Renault_ПолФизическогоЛица.мужской)
		|			ТОГДА ""Сын""
		|		КОГДА ДанныеФизическихЛиц.Пол = ЗНАЧЕНИЕ(Перечисление.Renault_ПолФизическогоЛица.Женский)
		|			ТОГДА ""Дочь""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ТипСвязи
		|ИЗ
		|	ФизЛицо КАК ФизЛицо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|		ПО ФизЛицо.ФизическоеЛицо <> ДанныеФизическихЛиц.ФизическоеЛицо
		|			И ФизЛицо.Фамилия = ДанныеФизическихЛиц.Фамилия
		|			И ФизЛицо.ОтчествоДетей = ДанныеФизическихЛиц.Отчество
		|			И (ДанныеФизическихЛиц.ДатаРождения > ФизЛицо.ДатаРождения
		|					И ФизЛицо.ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ДанныеФизическихЛиц.ДатаРождения = ДАТАВРЕМЯ(1, 1, 1))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ФизЛицо.ФизическоеЛицо,
		|	ДанныеФизическихЛиц.ФизическоеЛицо,
		|	ВЫБОР
		|		КОГДА ДанныеФизическихЛиц.Пол = ЗНАЧЕНИЕ(Перечисление.Renault_ПолФизическогоЛица.мужской)
		|			ТОГДА ""Отец""
		|		КОГДА ДанныеФизическихЛиц.Пол = ЗНАЧЕНИЕ(Перечисление.Renault_ПолФизическогоЛица.Женский)
		|			ТОГДА ""Мать""
		|		ИНАЧЕ """"
		|	КОНЕЦ
		|ИЗ
		|	ФизЛицо КАК ФизЛицо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|		ПО (ДанныеФизическихЛиц.ДатаРождения < ФизЛицо.ДатаРождения
		|					И ФизЛицо.ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ДанныеФизическихЛиц.ДатаРождения = ДАТАВРЕМЯ(1, 1, 1))
		|			И ФизЛицо.ФизическоеЛицо <> ДанныеФизическихЛиц.ФизическоеЛицо
		|			И ФизЛицо.Фамилия = ДанныеФизическихЛиц.Фамилия
		|			И ФизЛицо.ИмяРодителя = ДанныеФизическихЛиц.Имя
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ФизЛицо.ФизическоеЛицо,
		|	ДанныеФизическихЛиц.ФизическоеЛицо,
		|	ВЫБОР
		|		КОГДА ДанныеФизическихЛиц.Пол = ЗНАЧЕНИЕ(Перечисление.Renault_ПолФизическогоЛица.мужской)
		|			ТОГДА ""Брат""
		|		КОГДА ДанныеФизическихЛиц.Пол = ЗНАЧЕНИЕ(Перечисление.Renault_ПолФизическогоЛица.Женский)
		|			ТОГДА ""Сестра""
		|		ИНАЧЕ """"
		|	КОНЕЦ
		|ИЗ
		|	ФизЛицо КАК ФизЛицо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|		ПО ФизЛицо.ФизическоеЛицо <> ДанныеФизическихЛиц.ФизическоеЛицо
		|			И ФизЛицо.Фамилия = ДанныеФизическихЛиц.Фамилия
		|			И ФизЛицо.Отчество = ДанныеФизическихЛиц.Отчество";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтрокаРеквизитов = "";
	
	Для каждого ТекущаяКолонка Из РезультатЗапроса.Колонки Цикл
		СтрокаРеквизитов = СтрокаРеквизитов + ТекущаяКолонка.Имя+",";
	КонецЦикла; 
	
	СтрокаРеквизитов = Лев(СтрокаРеквизитов,СтрДлина(СтрокаРеквизитов)-1);
	
	МассивРодственников = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
		 СтруктураДанных = Новый Структура(СтрокаРеквизитов);
		 ЗаполнитьЗначенияСвойств(СтруктураДанных,ВыборкаДетальныеЗаписи);
		 
		 МассивРодственников.Добавить(СтруктураДанных);
		 
	 КонецЦикла;
	 
	 Возврат МассивРодственников;

КонецФункции // ПолучитьМассивПредпологаемыхРодственников()

//Процедуры событий

Процедура DMS_ПриЗаписиФизическихЛицПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	а=0;
	
	#Если Клиент Тогда
		
		ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
		
		ОтправитьДанныеПоОПД(Источник);
		
		
		Если НЕ (ЗначениеЗаполнено(ДЦ) И ДЦ.Автосервис_ИспользуетсяНоваяВерсия = Истина) Тогда
				
			Возврат;
			
		КонецЕсли;
		
	#КонецЕсли
	
	ТипИсточника = ТипЗнч(Источник);
	
	Если ТипИсточника = Тип("СправочникОбъект.Контрагенты") Тогда
		
		Если Источник.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
			ЗаписатьФИОФизическогоЛица(Источник.Ссылка,,Источник.ДатаРождения);		
			РегистрыСведений.Renault_НормализованныеКонтактыДляПоиска.НормализоватьВсеКонтакты(Источник.Ссылка);
			ПереименоватьПрофильФиическогоЛица(Источник.Ссылка);
			Справочники.Renault_ПрофилиКлиентов.СоздатьИзменитьПрофильКонтрагента(Источник.Ссылка);
			Справочники.Renault_ПрофилиКлиентов.ЗаполнитьРодственников(Источник.Ссылка);
			//ЗаполнитьПрофильПоКонтактнойИнформации(Источник.Ссылка);
			//ЗаполнитьПрофильКлиентаПоФИО(Источник.Ссылка);
			Если Источник.ЭтоНовый() ИЛИ (Источник.СогласиеНаПолучениеSMS <> Источник.Ссылка.СогласиеНаПолучениеSMS) Тогда
				ЗаписатьСогласиеНаОПД(Источник);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипИсточника = Тип("СправочникОбъект.CRM_ПотенциальныеКонтрагенты") Тогда 
		
		ЗаписатьФИОФизическогоЛица(Источник.Ссылка,,Источник.ДатаРождения);		
		РегистрыСведений.Renault_НормализованныеКонтактыДляПоиска.НормализоватьВсеКонтакты(Источник.Ссылка);
		ПереименоватьПрофильФиическогоЛица(Источник.Ссылка);
		Справочники.Renault_ПрофилиКлиентов.СоздатьИзменитьПрофильПотенциальногоКонтрагента(Источник.Ссылка);
		Справочники.Renault_ПрофилиКлиентов.ЗаполнитьРодственников(Источник.Ссылка);
		//ЗаполнитьПрофильПоКонтактнойИнформации(Источник.Ссылка);
		//ЗаполнитьПрофильКлиентаПоФИО(Источник.Ссылка);
		
	ИначеЕсли ТипИсточника = Тип("СправочникОбъект.Renault_ФизическиеЛица") Тогда
		ЗаписатьФИОФизическогоЛица(Источник.Ссылка,Источник.Пол,Источник.ДатаРождения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьСогласиеНаОПД(Источник) Экспорт
	
	Если НЕ Источник.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
		Возврат;
	КонецЕсли;
	
	СогласиеНаПолучениеSMSДата = НачалоДня(ТекущаяДата());
	
	Запись = РегистрыСведений.CRM_КлиентскиеДанные.СоздатьМенеджерЗаписи();
	Запись.Клиент = Источник.Ссылка;
	Запись.Прочитать();
	Если Запись.Выбран()Тогда
		//Если Запись.СогласиеНаПолучениеSMSДата <> СогласиеНаПолучениеSMSДата Тогда
			Запись.СогласиеНаПолучениеSMSДата = СогласиеНаПолучениеSMSДата;
			Запись.Записать();
		//КонецЕсли;
	Иначе
		Запись.Клиент = Источник.Ссылка;
		Запись.СогласиеНаПолучениеSMSДата = СогласиеНаПолучениеSMSДата;
		Запись.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПереименоватьПрофильФиическогоЛица(ФизическоеЛицо)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Клиенты.Ссылка КАК ПрофильСсылка,
		|	ДанныеФизическихЛиц.ФИО КАК Наименование,
		|	ДанныеФизическихЛиц.Фамилия,
		|	ДанныеФизическихЛиц.Имя,
		|	ДанныеФизическихЛиц.Отчество,
		|	ДанныеФизическихЛиц.ДатаРождения
		|ИЗ
		|	Справочник.Renault_ПрофилиКлиентов.Клиенты КАК Клиенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|		ПО Клиенты.Клиент = ДанныеФизическихЛиц.ФизическоеЛицо
		|ГДЕ
		|	Клиенты.Клиент = &ФизическоеЛицо
		|	И Клиенты.Ссылка.КоличествоКлиентов = 1
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПрофильСсылка
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПрофилей = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаПрофилей.Следующий() Цикл
		
		ОбъектПрофиль = ВыборкаПрофилей.ПрофильСсылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ОбъектПрофиль,ВыборкаПрофилей);
		ОбъектПрофиль.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПрофильКлиентаПоФИО(ФизическоеЛицо) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДанныеФизическогоЛица.ФизическоеЛицо,
		|	ДанныеФизическогоЛица.Фамилия,
		|	ДанныеФизическогоЛица.Имя,
		|	ДанныеФизическогоЛица.Отчество,
		|	ДанныеФизическогоЛица.ДатаРождения,
		|	ЕСТЬNULL(ПрофилиКлиентов.Ссылка, ЗНАЧЕНИЕ(Справочник.Renault_ПрофилиКлиентов.пустаяСсылка)) КАК Профиль
		|ПОМЕСТИТЬ ДанныеОФизЛице
		|ИЗ
		|	РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическогоЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_ПрофилиКлиентов КАК ПрофилиКлиентов
		|		ПО ДанныеФизическогоЛица.Фамилия = ПрофилиКлиентов.Фамилия
		|			И ДанныеФизическогоЛица.Имя = ПрофилиКлиентов.Имя
		|			И ДанныеФизическогоЛица.Отчество = ПрофилиКлиентов.Отчество
		|			И ДанныеФизическогоЛица.ДатаРождения = ПрофилиКлиентов.ДатаРождения
		|ГДЕ
		|	ДанныеФизическогоЛица.ФизическоеЛицо = &ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДанныеОФизЛице.ФизическоеЛицо,
		|	ДанныеОФизЛице.Фамилия,
		|	ДанныеОФизЛице.Имя,
		|	ДанныеОФизЛице.Отчество,
		|	ДанныеОФизЛице.ДатаРождения,
		|	ДанныеОФизЛице.Профиль,
		|	ВЫБОР
		|		КОГДА КлиентыПрофиля.Ссылка ЕСТЬ NULL 
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьЗапись,
		|	ЕСТЬNULL(КлиентыПрофиля.Ссылка.СовпадениеПоКонтактнойИнформации, ЛОЖЬ) КАК СовпадениеПоКонтактнойИнформации
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	ДанныеОФизЛице КАК ДанныеОФизЛице
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_ПрофилиКлиентов.Клиенты КАК КлиентыПрофиля
		|		ПО ДанныеОФизЛице.Профиль = КлиентыПрофиля.Ссылка
		|			И ДанныеОФизЛице.ФизическоеЛицо = КлиентыПрофиля.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Данные.ФизическоеЛицо,
		|	Данные.Фамилия,
		|	Данные.Имя,
		|	Данные.Отчество,
		|	Данные.ДатаРождения,
		|	Данные.Профиль,
		|	Данные.ЕстьЗапись,
		|	Данные.СовпадениеПоКонтактнойИнформации
		|ИЗ
		|	Данные КАК Данные
		|ГДЕ
		|	НЕ Данные.ЕстьЗапись
		|	И Данные.СовпадениеПоКонтактнойИнформации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Данные.ФизическоеЛицо,
		|	Данные.Фамилия,
		|	Данные.Имя,
		|	Данные.Отчество,
		|	Данные.ДатаРождения,
		|	Данные.Профиль,
		|	Данные.ЕстьЗапись,
		|	Данные.СовпадениеПоКонтактнойИнформации
		|ИЗ
		|	Данные КАК Данные
		|ГДЕ
		|	НЕ Данные.ЕстьЗапись
		|	И НЕ Данные.СовпадениеПоКонтактнойИнформации";
	
	мРезультатЗапроса = Запрос.ВыполнитьПакет();
	
	РезультатЕстьСовпадение = мРезультатЗапроса[2];
	
	Если РезультатЕстьСовпадение.Пустой() Тогда
		РезультатЗапроса = мРезультатЗапроса[3];
	Иначе 
		РезультатЗапроса = РезультатЕстьСовпадение;
	КонецЕсли; 
	
	ВыборкаДанных = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДанных.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(ВыборкаДанных.Профиль) Тогда
			
			ОбъектПрофиль = Справочники.Renault_ПрофилиКлиентов.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(ОбъектПрофиль,ВыборкаДанных);
			
			НоваяЗапись = ОбъектПрофиль.Клиенты.Добавить();
			НоваяЗапись.Клиент = ВыборкаДанных.ФизическоеЛицо;
			
			ОбъектПрофиль.КоличествоКлиентов = ОбъектПрофиль.Клиенты.Количество();
			
			ОбъектПрофиль.Записать();
			
		Иначе 
			
			ОбъектПрофиль = ВыборкаДанных.Профиль.ПолучитьОбъект();
			
			Если ОбъектПрофиль.Клиенты.Найти(ВыборкаДанных.ФизическоеЛицо,"Клиент") = Неопределено Тогда
				
				НоваяЗапись = ОбъектПрофиль.Клиенты.Добавить();
				НоваяЗапись.Клиент = ВыборкаДанных.ФизическоеЛицо;
				
				ОбъектПрофиль.КоличествоКлиентов = ОбъектПрофиль.Клиенты.Количество();
				
				ОбъектПрофиль.Записать();
				
			КонецЕсли; 
						
		КонецЕсли; 
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьПрофильПоКонтактнойИнформации(ФизическоеЛицо)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НормализованныеКонтактыДляПоиска.Объект,
		|	НормализованныеКонтактыДляПоиска.Данные
		|ПОМЕСТИТЬ КонтактыКлиента
		|ИЗ
		|	РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК НормализованныеКонтактыДляПоиска
		|ГДЕ
		|	НормализованныеКонтактыДляПоиска.Объект = &Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КонтактыКлиента.Объект КАК Клиент,
		|	НормализованныеКонтактыДляПоиска.Объект КАК КлиентПрофиля,
		|	ИСТИНА КАК СовпадениеПоКонтактнойИнформации
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	КонтактыКлиента КАК КонтактыКлиента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК НормализованныеКонтактыДляПоиска
		|		ПО КонтактыКлиента.Объект <> НормализованныеКонтактыДляПоиска.Объект
		|			И (КонтактыКлиента.Данные ПОДОБНО ""%"" + НормализованныеКонтактыДляПоиска.Данные + ""%"")
		|ГДЕ
		|	КонтактыКлиента.Данные <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КонтактыКлиента.Объект,
		|	НормализованныеКонтактыДляПоиска.Объект,
		|	ИСТИНА
		|ИЗ
		|	КонтактыКлиента КАК КонтактыКлиента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК НормализованныеКонтактыДляПоиска
		|		ПО КонтактыКлиента.Объект <> НормализованныеКонтактыДляПоиска.Объект
		|			И (НормализованныеКонтактыДляПоиска.Данные ПОДОБНО ""%"" + КонтактыКлиента.Данные + ""%"")
		|ГДЕ
		|	КонтактыКлиента.Данные <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Данные.Клиент,
		|	Данные.КлиентПрофиля,
		|	Данные.СовпадениеПоКонтактнойИнформации,
		|	ДанныеФизическихЛиц.Фамилия,
		|	ДанныеФизическихЛиц.Имя,
		|	ДанныеФизическихЛиц.Отчество,
		|	ДанныеФизическихЛиц.Пол,
		|	ДанныеФизическихЛиц.ДатаРождения
		|ИЗ
		|	Данные КАК Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|		ПО Данные.Клиент = ДанныеФизическихЛиц.ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("Объект", ФизическоеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПрофильКлиента = ПолучитьПрофильКлиентаКИ(ВыборкаДетальныеЗаписи.КлиентПрофиля); 
		
		Если Не ЗначениеЗаполнено(ПрофильКлиента) Тогда
			ПрофильКлиента = ПолучитьПрофильКлиентаКИ(ВыборкаДетальныеЗаписи.Клиент); 
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ПрофильКлиента) Тогда
			
			ПрофильОбъект = ПрофильКлиента.ПолучитьОбъект();
						
			Если ПрофильОбъект.Клиенты.Найти(ВыборкаДетальныеЗаписи.КлиентПрофиля,"Клиент") = Неопределено Тогда
				НоваяСтрока = ПрофильОбъект.Клиенты.Добавить();
				НоваяСтрока.Клиент = ВыборкаДетальныеЗаписи.КлиентПрофиля;				
			КонецЕсли; 
			
			Если ПрофильОбъект.Клиенты.Найти(ВыборкаДетальныеЗаписи.Клиент,"Клиент") = Неопределено Тогда
				НоваяСтрока = ПрофильОбъект.Клиенты.Добавить();
				НоваяСтрока.Клиент = ВыборкаДетальныеЗаписи.Клиент;				
			КонецЕсли; 
					
			ПрофильОбъект.КоличествоКлиентов = ПрофильОбъект.Клиенты.Количество();
			
			ПрофильОбъект.Записать();
			
		Иначе 
			
			ПрофильОбъект = Справочники.Renault_ПрофилиКлиентов.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(ПрофильОбъект,ВыборкаДетальныеЗаписи);
			
			НоваяСтрока = ПрофильОбъект.Клиенты.Добавить();
			НоваяСтрока.Клиент = ВыборкаДетальныеЗаписи.КлиентПрофиля;
			
			НоваяСтрока = ПрофильОбъект.Клиенты.Добавить();
			НоваяСтрока.Клиент = ВыборкаДетальныеЗаписи.Клиент;
			
			ПрофильОбъект.КоличествоКлиентов = ПрофильОбъект.Клиенты.Количество();
			
			ПрофильОбъект.Записать();
			
		КонецЕсли; 
		
		ПрофильКлиентаДляОчистки = ПолучитьПрофильКлиента(ВыборкаДетальныеЗаписи.КлиентПрофиля); 
		
		Если Не ЗначениеЗаполнено(ПрофильКлиентаДляОчистки) Тогда
			ПрофильКлиентаДляОчистки = ПолучитьПрофильКлиента(ВыборкаДетальныеЗаписи.Клиент); 
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ПрофильКлиентаДляОчистки) Тогда
			
			ОбъектПрофильКлиентаДляОчистки = ПрофильКлиентаДляОчистки.ПолучитьОбъект();
			
			СтруктураПоискаДляУдаления = Новый Структура("Клиент",ВыборкаДетальныеЗаписи.КлиентПрофиля);
			
			СтрокиПоискаДляУдаления = ОбъектПрофильКлиентаДляОчистки.Клиенты.НайтиСтроки(СтруктураПоискаДляУдаления);
			
			Для каждого СтрокаУдаления Из СтрокиПоискаДляУдаления Цикл
				 ОбъектПрофильКлиентаДляОчистки.Клиенты.Удалить(СтрокаУдаления);
			КонецЦикла; 
			
			СтруктураПоискаДляУдаления = Новый Структура("Клиент",ВыборкаДетальныеЗаписи.Клиент);
			
			СтрокиПоискаДляУдаления = ОбъектПрофильКлиентаДляОчистки.Клиенты.НайтиСтроки(СтруктураПоискаДляУдаления);
			
			Для каждого СтрокаУдаления Из СтрокиПоискаДляУдаления Цикл
				 ОбъектПрофильКлиентаДляОчистки.Клиенты.Удалить(СтрокаУдаления);
			КонецЦикла; 
			
			Если Не ОбъектПрофильКлиентаДляОчистки.ПометкаУдаления Тогда
				ОбъектПрофильКлиентаДляОчистки.ПометкаУдаления = (ОбъектПрофильКлиентаДляОчистки.Клиенты.Количество() = 0);
			КонецЕсли; 
			
			ОбъектПрофильКлиентаДляОчистки.Записать();
						
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПрофильКлиентаКИ(Клиент) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Клиенты.Ссылка
		|ИЗ
		|	Справочник.Renault_ПрофилиКлиентов.Клиенты КАК Клиенты
		|ГДЕ
		|	Клиенты.Клиент = &Клиент
		|	И Клиенты.Ссылка.СовпадениеПоКонтактнойИнформации";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Профиль = Справочники.Renault_ПрофилиКлиентов.ПустаяСсылка();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Профиль = ВыборкаДетальныеЗаписи.Ссылка;	
	КонецЕсли; 
	
	Возврат Профиль;
	
КонецФункции // ПолучитьПрофильКлиента()

Функция ПолучитьПрофильКлиента(Клиент) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Клиенты.Ссылка
		|ИЗ
		|	Справочник.Renault_ПрофилиКлиентов.Клиенты КАК Клиенты
		|ГДЕ
		|	Клиенты.Клиент = &Клиент
		|	И Не Клиенты.Ссылка.СовпадениеПоКонтактнойИнформации";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Профиль = Справочники.Renault_ПрофилиКлиентов.ПустаяСсылка();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Профиль = ВыборкаДетальныеЗаписи.Ссылка;	
	КонецЕсли; 
	
	Возврат Профиль;
	
КонецФункции // ПолучитьПрофильКлиента()

Процедура DMS_ПередЗаписьюФизическихЛицПередЗаписью(Источник, Отказ) Экспорт
	
	Если Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза.НеИспользоватьПроверкуФИО Тогда
	
		Возврат;
		
	КонецЕсли;
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	#Если Клиент Тогда
		
		ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
		
		Если НЕ (ЗначениеЗаполнено(ДЦ) И ДЦ.Автосервис_ИспользуетсяНоваяВерсия = Истина) Тогда
			
			Возврат;
			
		КонецЕсли;
		
	#КонецЕсли
	
	ТипИсточника = ТипЗнч(Источник);
	
	Если ТипИсточника = Тип("СправочникОбъект.Контрагенты") Тогда
		
		Если Источник.СогласиеНаОбработкуПерсональныхДанных <> Источник.Ссылка.СогласиеНаОбработкуПерсональныхДанных Тогда 
			Источник.ДополнительныеСвойства.Вставить("ПерсональныеДанные",Источник.СогласиеНаОбработкуПерсональныхДанных);
		КонецЕсли;
		
		Если Источник.СогласиеНаПолучениеSMS <> Источник.Ссылка.СогласиеНаПолучениеSMS Тогда 
			Источник.ДополнительныеСвойства.Вставить("Коммуникация",Источник.СогласиеНаПолучениеSMS);
		КонецЕсли;
		
		Если Источник.ФормаСобственности <> Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
			Возврат;
		КонецЕсли; 
		
		Если ПустаяСтрока(Источник.Наименование) ИЛИ Источник.Наименование = "Не заполнено" Тогда
			Возврат;
		КонецЕсли; 
		
		СтруктураФИО = ПроверитьФИО(Источник);
		
		Если СтруктураФИО = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если ПустаяСтрока(СокрЛП(СтруктураФИО.ФИО)) Тогда
			Возврат;
		КонецЕсли; 
		
		#Если Клиент Тогда
			
			Режим = РежимДиалогаВопрос.ДаНет;
			Ответ = Вопрос("Возможно Вы имели виду: "+Символы.ПС+СокрЛП(СтруктураФИО.ФИО)+"?", Режим, 0);
			
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Возврат;
			КонецЕсли;
			
			Источник.Наименование 		= СтруктураФИО.ФИО;
			Источник.НаименованиеПолное = СтруктураФИО.ФИО;
			ЗаполнитьЗначенияСвойств(Источник,СтруктураФИО,"Фамилия,Имя,Отчество");
			
		#КонецЕсли
	
	ИначеЕсли ТипИсточника = Тип("СправочникОбъект.CRM_ПотенциальныеКонтрагенты") Тогда
		
		Если ПустаяСтрока(Источник.Наименование) ИЛИ Источник.Наименование = "Не заполнено" Тогда
			Возврат;
		КонецЕсли; 
		
		СтруктураФИО = ПроверитьФИО(Источник);
		
		Если СтруктураФИО = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если ПустаяСтрока(СокрЛП(СтруктураФИО.ФИО)) Тогда
			Возврат;
		КонецЕсли; 
		
		#Если Клиент Тогда
			
			Режим = РежимДиалогаВопрос.ДаНет;
			Ответ = Вопрос("Возможно Вы имели виду: "+Символы.ПС+СокрЛП(СтруктураФИО.ФИО)+"?", Режим, 0);
			
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Возврат;
			КонецЕсли;
			
			Источник.Наименование 		= СтруктураФИО.ФИО;
			Источник.НаименованиеПолное = СтруктураФИО.ФИО;
			ЗаполнитьЗначенияСвойств(Источник,СтруктураФИО,"Фамилия,Имя,Отчество");
			
		#КонецЕсли
		
	КонецЕсли; 
	
КонецПроцедуры

Функция ПроверитьФИО(КонтрагентОбъект)
	
	СтруктураФИО = ФамилияИмяОтчество(КонтрагентОбъект.Наименование);
	
	Запрос = Новый Запрос;
	
	Если СтруктураФИО.Свойство("Фамилия") Тогда
		Запрос.УстановитьПараметр("Фамилия",СтруктураФИО.Фамилия);
	Иначе 
		СтруктураФИО.Вставить("Фамилия");
		Запрос.УстановитьПараметр("Фамилия","");
	КонецЕсли; 
	
	Если СтруктураФИО.Свойство("Имя") Тогда
		Запрос.УстановитьПараметр("Имя",СтруктураФИО.Имя);
	Иначе 
		СтруктураФИО.Вставить("Имя");
		Запрос.УстановитьПараметр("Имя","");
	КонецЕсли; 
	
	Если СтруктураФИО.Свойство("Отчество") Тогда
		Запрос.УстановитьПараметр("Отчество",СтруктураФИО.Отчество);
	Иначе 
		СтруктураФИО.Вставить("Отчество");
		Запрос.УстановитьПараметр("Отчество","");
	КонецЕсли; 
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочнаяИнформацияПоФИО.Тип КАК Тип,
		|	СправочнаяИнформацияПоФИО.Значение КАК Значение
		|ПОМЕСТИТЬ ДанныеДляПроверки
		|ИЗ
		|	РегистрСведений.DMS_СправочнаяИнформацияПоФИО КАК СправочнаяИнформацияПоФИО
		|ГДЕ
		|	СправочнаяИнформацияПоФИО.Значение = &Фамилия
		|			И &Фамилия <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СправочнаяИнформацияПоФИО.Тип,
		|	СправочнаяИнформацияПоФИО.Значение
		|ИЗ
		|	РегистрСведений.DMS_СправочнаяИнформацияПоФИО КАК СправочнаяИнформацияПоФИО
		|ГДЕ
		|	СправочнаяИнформацияПоФИО.Значение = &Имя
		|			И &Имя <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СправочнаяИнформацияПоФИО.Тип,
		|	СправочнаяИнформацияПоФИО.Значение
		|ИЗ
		|	РегистрСведений.DMS_СправочнаяИнформацияПоФИО КАК СправочнаяИнформацияПоФИО
		|ГДЕ
		|	СправочнаяИнформацияПоФИО.Значение = &Отчество
		|			И &Отчество <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДанныеДляПроверки.Значение КАК Имя,
		|	"""" КАК Отчество
		|ПОМЕСТИТЬ мИмяОтчество
		|ИЗ
		|	ДанныеДляПроверки КАК ДанныеДляПроверки
		|ГДЕ
		|	ДанныеДляПроверки.Тип = ЗНАЧЕНИЕ(перечисление.DMS_ТипыЗначенийФИО.Имя)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	"""",
		|	ДанныеДляПроверки.Значение
		|ИЗ
		|	ДанныеДляПроверки КАК ДанныеДляПроверки
		|ГДЕ
		|	ДанныеДляПроверки.Тип = ЗНАЧЕНИЕ(перечисление.DMS_ТипыЗначенийФИО.Отчество)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(мИмяОтчество.Имя) КАК Имя,
		|	МАКСИМУМ(мИмяОтчество.Отчество) КАК Отчество
		|ПОМЕСТИТЬ ИмяОтчество
		|ИЗ
		|	мИмяОтчество КАК мИмяОтчество
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА &Фамилия <> ИмяОтчество.Имя
		|				И &Фамилия <> ИмяОтчество.Отчество
		|			ТОГДА &Фамилия
		|		КОГДА &Имя <> ИмяОтчество.Имя
		|				И &Имя <> ИмяОтчество.Отчество
		|			ТОГДА &Имя
		|		КОГДА &Отчество <> ИмяОтчество.Имя
		|				И &Отчество <> ИмяОтчество.Отчество
		|			ТОГДА &Отчество
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Фамилия,
		|	ИмяОтчество.Имя,
		|	ИмяОтчество.Отчество
		|ПОМЕСТИТЬ мФИО
		|ИЗ
		|	ИмяОтчество КАК ИмяОтчество
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	мФИО.Фамилия + "" "" + мФИО.Имя + "" "" + мФИО.Отчество КАК ФИО,
		|	мФИО.Фамилия,
		|	мФИО.Имя,
		|	мФИО.Отчество
		|ИЗ
		|	мФИО КАК мФИО";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаФИО = РезультатЗапроса.Выбрать();
	
	СтруктураВозврата = Новый Структура("ФИО,Фамилия,Имя,Отчество");
	
	Если ВыборкаФИО.Следующий() Тогда
	
		Если ВыборкаФИО.Фамилия = СтруктураФИО.Фамилия
			И ВыборкаФИО.Имя = СтруктураФИО.Имя 
			И ВыборкаФИО.Отчество = СтруктураФИО.Отчество Тогда
		
			Возврат Неопределено;
		Иначе 
			ЗаполнитьЗначенияСвойств(СтруктураВозврата,ВыборкаФИО);
			Возврат СтруктураВозврата;
		КонецЕсли; 
	
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции

Процедура ОтправитьДанныеПоОПД(Источник)
	
	СтруктураСвойств = Источник.ДополнительныеСвойства;
	
	Если СтруктураСвойств.Свойство("ПерсональныеДанные") Тогда 
		ОтправитьДанныеВWeb("ПерсональныеДанные",СтруктураСвойств.ПерсональныеДанные,Источник);	
	КонецЕсли;
	
	Если СтруктураСвойств.Свойство("Коммуникация") Тогда 
		ОтправитьДанныеВWeb("Коммуникация",СтруктураСвойств.Коммуникация,Источник);	
	КонецЕсли;

КонецПроцедуры

Процедура ОтправитьДанныеВWeb(ВидСогласия,Согласие,Источник)
	
	//Будем просто писать данные в жр
	Попытка
		СтруктураПараметровОПД = ЗаполнитьДанныеПоКонтрагенту(ВидСогласия,Согласие,Источник.ссылка);
		
		ДанныеОПД = DMS_ОбщегоНазначенияСервер.ПолучитьДанныеОПД(СтруктураПараметровОПД,Источник.Ссылка);
		
		Если ДанныеОПД = Неопределено Тогда
			Текст = "Не удалось сформировать соответствующий документ.
			| "+ВидСогласия+
			"| "+Согласие;
			ЗаписьЖурналаРегистрации("ОтправкаДанныхПоОПД", УровеньЖурналаРегистрации.Информация,Метаданные.Справочники.Контрагенты ,Источник.Ссылка , Текст);
			//ПоказатьПредупреждение(,"Не удалось получить печатную форму");
		Иначе
			Текст = "Сформирован соответствующий документ.
			| "+ВидСогласия+
			"| "+Согласие;
			ЗаписьЖурналаРегистрации("ОтправкаДанныхПоОПД", УровеньЖурналаРегистрации.Информация,Метаданные.Справочники.Контрагенты ,Источник.Ссылка , Текст);
			//Для каждого Файл Из ДанныеОПД Цикл
			//	НачатьПолучениеФайлаССервера(ПоместитьВоВременноеХранилище(Base64Значение(Файл["ДанныеФайла"])), Файл["ИмяФайла"], Новый ПараметрыДиалогаПолученияФайлов());
			//КонецЦикла;	
		КонецЕсли;
	Исключение
			ЗаписьЖурналаРегистрации("ОтправкаДанныхПоОПД", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

Функция ЗаполнитьДанныеПоКонтрагенту(ВидСогласия,Согласие,Контрагент)
	
	СтруктураОбъекта = Новый Структура;
	СтруктураКлиента = Новый Структура;
	СтруктураДокумента = Новый Структура;
	СтруктураАвтомобиля = Новый Структура;
	СтруктураСогласия = Новый Структура;
	СтруктураОтвветсвенный = Новый Структура;
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПодтверждающиеДокументы.Ссылка КАК Ссылка,
		|	ПодтверждающиеДокументы.ДатаВыдачи КАК ДатаВыдачи,
		|	ПодтверждающиеДокументы.КемВыдан КАК КемВыдан,
		|	ПодтверждающиеДокументы.Серия КАК Серия,
		|	ПодтверждающиеДокументы.Номер КАК Номер
		|ИЗ
		|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
		|ГДЕ
		|	ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Паспорт)
		|	И ПодтверждающиеДокументы.Владелец = &Владелец
		|	И ПодтверждающиеДокументы.Текущий = ИСТИНА";
		Запрос.УстановитьПараметр("Владелец", Контрагент);
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			ПаспортСерия = Выборка.Серия;
			ПаспортНомер = Выборка.Номер;
			ПаспортВыданДата = Выборка.ДатаВыдачи;
			ПаспортВыданКем = Выборка.КемВыдан;
		Иначе 
			ПаспортСерия = "";
			ПаспортНомер = "";
			ПаспортВыданДата = Дата('00010101');
			ПаспортВыданКем = "";
		КонецЕсли;
	
	
	СтруктураДокумента.Вставить("passportnumber",ПаспортСерия);
	СтруктураДокумента.Вставить("passportseries",ПаспортНомер);
	СтруктураДокумента.Вставить("passportissued",ПаспортВыданКем); 
	СтруктураДокумента.Вставить("passportday",День(ПаспортВыданДата));
	СтруктураДокумента.Вставить("passportmonth",Месяц(ПаспортВыданДата));
	СтруктураДокумента.Вставить("passportyear",Год(ПаспортВыданДата));

	СтруктураКлиента.Вставить("lastname",Контрагент.Фамилия);
	СтруктураКлиента.Вставить("firstname",Контрагент.Имя);
	СтруктураКлиента.Вставить("middlename",Контрагент.Отчество);
	СтруктураКлиента.Вставить("birthday",Контрагент.ДатаРождения);
	СтруктураКлиента.Вставить("gender",?(Контрагент.Пол=Перечисления.ПолФизическихЛиц.НеУказан,"",""+Контрагент.Пол));
	СтруктураКлиента.Вставить("address","");
	СтруктураКлиента.Вставить("tel",Контрагент.ОсновнойТелефон);
	СтруктураКлиента.Вставить("email","");
	СтруктураКлиента.Вставить("company",?(Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо,Истина,Ложь));
	СтруктураКлиента.Вставить("document",СтруктураДокумента);
	СтруктураОбъекта.Вставить("client",СтруктураКлиента);
	
	СтруктураАвтомобиля.Вставить("mark",""+"");
	СтруктураАвтомобиля.Вставить("vin","");
	СтруктураАвтомобиля.Вставить("daybuycar",Дата('00010101'));
	
	
	СтруктураСогласия.Вставить("form",ВидСогласия);
	СтруктураСогласия.Вставить("agree",?(Согласие=Перечисления.ВариантыОтветов.Да,Истина,Ложь));
	СтруктураОбъекта.Вставить("consent",СтруктураСогласия);
	
	СтруктураОтвветсвенный.Вставить("name",""+ПараметрыСеанса.Пользователь.Сотрудник);
	СтруктураОтвветсвенный.Вставить("from","Форма контрагента");
	СтруктураОбъекта.Вставить("responsible",СтруктураОтвветсвенный);
	
	Возврат СтруктураОбъекта;
	
КонецФункции
